<a href="https://colab.research.google.com/github/Shreya869/Ask-Agri/blob/main/AskAgri_minor.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import files
uploaded = files.upload()

Saving pesticides.csv to pesticides.csv
Saving rainfall.csv to rainfall.csv
Saving temp.csv to temp.csv
Saving yield.csv to yield.csv
Saving yield_df.csv to yield_df.csv

In [2]:
import numpy as np 
import pandas as pd

In [3]:
df_yield = pd.read_csv('yield.csv')
df_yield.shape

(56717, 12)

In [4]:
df_yield.head()

  Domain Code Domain  Area Code         Area  ...  Year Code  Year   Unit  Value
0          QC  Crops          2  Afghanistan  ...       1961  1961  hg/ha  14000
1          QC  Crops          2  Afghanistan  ...       1962  1962  hg/ha  14000
2          QC  Crops          2  Afghanistan  ...       1963  1963  hg/ha  14260
3          QC  Crops          2  Afghanistan  ...       1964  1964  hg/ha  14257
4          QC  Crops          2  Afghanistan  ...       1965  1965  hg/ha  14400

[5 rows x 12 columns]

In [12]:
df_new = df_yield[df_yield['Area'] == 'India']
print(df_new)

      Domain Code Domain  Area Code   Area  ...  Year Code  Year   Unit   Value
24489          QC  Crops        100  India  ...       1961  1961  hg/ha   71861
24490          QC  Crops        100  India  ...       1962  1962  hg/ha   71396
24491          QC  Crops        100  India  ...       1963  1963  hg/ha   71134
24492          QC  Crops        100  India  ...       1964  1964  hg/ha  115697
24493          QC  Crops        100  India  ...       1965  1965  hg/ha  126375
...           ...    ...        ...    ...  ...        ...   ...    ...     ...
24932          QC  Crops        100  India  ...       2012  2012  hg/ha   31775
24933          QC  Crops        100  India  ...       2013  2013  hg/ha   31538
24934          QC  Crops        100  India  ...       2014  2014  hg/ha   31457
24935          QC  Crops        100  India  ...       2015  2015  hg/ha   27496
24936          QC  Crops        100  India  ...       2016  2016  hg/ha   30930

[448 rows x 12 columns]

In [13]:
df_yield = df_yield.rename(index=str, columns={"Value": "hg/ha_yield"})
df_yield.head()

  Domain Code Domain  Area Code  ...  Year   Unit hg/ha_yield
0          QC  Crops          2  ...  1961  hg/ha       14000
1          QC  Crops          2  ...  1962  hg/ha       14000
2          QC  Crops          2  ...  1963  hg/ha       14260
3          QC  Crops          2  ...  1964  hg/ha       14257
4          QC  Crops          2  ...  1965  hg/ha       14400

[5 rows x 12 columns]

In [15]:
df_new = df_new.drop(['Year Code','Element Code','Element','Year Code','Area Code','Domain Code','Domain','Unit','Item Code'], axis=1)
df_new.head()

        Area     Item  Year   Value
24489  India  Cassava  1961   71861
24490  India  Cassava  1962   71396
24491  India  Cassava  1963   71134
24492  India  Cassava  1964  115697
24493  India  Cassava  1965  126375

In [16]:
df_new.describe()

              Year          Value
count   448.000000     448.000000
mean   1988.500000   64607.281250
std      16.181299   79289.488015
min    1961.000000    4288.000000
25%    1974.750000   10115.750000
50%    1988.500000   24840.000000
75%    2002.250000   88248.000000
max    2016.000000  385818.000000

In [17]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 448 entries, 24489 to 24936
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Area    448 non-null    object
 1   Item    448 non-null    object
 2   Year    448 non-null    int64
 3   Value   448 non-null    int64
dtypes: int64(2), object(2)
memory usage: 17.5+ KB

In [18]:

df_rain = pd.read_csv('rainfall.csv')
df_rain.head()

          Area  Year average_rain_fall_mm_per_year
0  Afghanistan  1985                           327
1  Afghanistan  1986                           327
2  Afghanistan  1987                           327
3  Afghanistan  1989                           327
4  Afghanistan  1990                           327

In [20]:

df_rain = pd.read_csv('rainfall.csv')
df_rain.head()

d

          Area  Year average_rain_fall_mm_per_year
0  Afghanistan  1985                           327
1  Afghanistan  1986                           327
2  Afghanistan  1987                           327
3  Afghanistan  1989                           327
4  Afghanistan  1990                           327